jsk-ros-pkg/jsk_aerial_robot/aerial_robot_nerve/stm32h7_nucleo/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
#define REG_WOL_FRAME2_CRC0        		0x50   	/* WF2CRC0 */
#define REG_WOL_FRAME2_CRC1        		0x52    	/* WF2CRC1 */
#define REG_WOL_FRAME2_BYTE_MASK0  		0x54  	/* WF2BM0 */
#define REG_WOL_FRAME2_BYTE_MASK1  		0x56   	/* WF2BM1 */
#define REG_WOL_FRAME2_BYTE_MASK2  		0x58   	/* WF2BM2 */
#define REG_WOL_FRAME2_BYTE_MASK3  		0x5A   	/* WF2BM3 */

#define REG_WOL_FRAME3_CRC0        		0x60 		/* WF3CRC0 */
#define REG_WOL_FRAME3_CRC1        		0x62   	/* WF3CRC1 */
#define REG_WOL_FRAME3_BYTE_MASK0  		0x64   	/* WF3BM0 */
#define REG_WOL_FRAME3_BYTE_MASK1  		0x66   	/* WF3BM1 */
#define REG_WOL_FRAME3_BYTE_MASK2  		0x68   	/* WF3BM2 */
#define REG_WOL_FRAME3_BYTE_MASK3  		0x6A    	/* WF3BM3 */

/*
 * Transmit/Receive Control Registers
 * (Offset 0x70 - 0x9F)
 */

/* Transmit Frame Header */
#define REG_QDR_DUMMY              		0x00   	/* Dummy address to access QMU RxQ, TxQ */
#define TX_CTRL_INTERRUPT_ON        	0x8000 	/* Transmit Interrupt on Completion */

#define TX_FLOW_CTRL_REG            	0x70 /**< Transmit Flow Control Register */
#define REG_TX_CTRL                		0x70   	/* TXCR */
#define TX_CTRL_ICMP_CHECKSUM       	0x0100 	/* Enable ICMP frame checksum generation */
#define TX_CTRL_UDP_CHECKSUM        	0x0080   /* Enable UDP frame checksum generation */
#define TX_CTRL_TCP_CHECKSUM        	0x0040   /* Enable TCP frame checksum generation */
#define TX_CTRL_IP_CHECKSUM         	0x0020   /* Enable IP frame checksum generation */
#define TX_CTRL_FLUSH_QUEUE         	0x0010   /* Clear transmit queue, reset tx frame pointer */
#define TX_CTRL_FLOW_ENABLE         	0x0008   /* Enable transmit flow control */
#define TX_CTRL_PAD_ENABLE          	0x0004   /* Eanble adding a padding to a packet shorter than 64 bytes */
#define TX_CTRL_CRC_ENABLE          	0x0002   /* Enable adding a CRC to the end of transmit frame */
#define TX_CTRL_ENABLE              	0x0001   /* Enable tranmsit */

#define REG_TX_STATUS              		0x72     /* TXSR */
#define TX_STAT_LATE_COL            	0x2000   /* Tranmsit late collision occurs */
#define TX_STAT_MAX_COL             	0x1000   /* Tranmsit maximum collision is reached */
#define TX_FRAME_ID_MASK            	0x003F   /* Transmit frame ID mask */
#define TX_STAT_ERRORS             		( TX_STAT_MAX_COL | TX_STAT_LATE_COL )

#define RX_FLOW_CTRL1_REG           	0x74 /**< Receive Flow Control Register 1 */
#define REG_RX_CTRL1               		0x74     /* RXCR1 */
#define RX_CTRL_FLUSH_QUEUE         	0x8000 	/* Clear receive queue, reset rx frame pointer */
#define RX_CTRL_UDP_CHECKSUM        	0x4000   /* Enable UDP frame checksum verification */
#define RX_CTRL_TCP_CHECKSUM        	0x2000   /* Enable TCP frame checksum verification */
#define RX_CTRL_IP_CHECKSUM         	0x1000   /* Enable IP frame checksum verification */
#define RX_CTRL_MAC_FILTER          	0x0800   /* Receive with address that pass MAC address filtering */
#define RX_CTRL_FLOW_ENABLE         	0x0400   /* Enable receive flow control */
#define RX_CTRL_BAD_PACKET          	0x0200   /* Eanble receive CRC error frames */
#define RX_CTRL_MULTICAST           	0x0100   /* Receive multicast frames that pass the CRC hash filtering */
#define RX_CTRL_BROADCAST           	0x0080   /* Receive all the broadcast frames */
#define RX_CTRL_ALL_MULTICAST       	0x0040   /* Receive all the multicast frames (including broadcast frames) */
#define RX_CTRL_UNICAST             	0x0020   /* Receive unicast frames that match the device MAC address */
#define RX_CTRL_PROMISCUOUS         	0x0010   /* Receive all incoming frames, regardless of frame's DA */
#define RX_CTRL_STRIP_CRC           	0x0008   /* Enable strip CRC on the received frames */
#define RX_CTRL_INVERSE_FILTER      	0x0002   /* Receive with address check in inverse filtering mode */
#define RX_CTRL_ENABLE              	0x0001   /* Enable receive */

/* Address filtering scheme mask */
#define RX_CTRL_FILTER_MASK    			( RX_CTRL_INVERSE_FILTER | RX_CTRL_PROMISCUOUS | RX_CTRL_MULTICAST | RX_CTRL_MAC_FILTER )

#define RX_FLOW_CTRL2_REG           	0x76 /**< Receive Flow Control Register 2 */
#define REG_RX_CTRL2               		0x76     /* RXCR2 */
#define RX_CTRL_IPV6_UDP_NOCHECKSUM 	0x0010   /* No checksum generation and verification if IPv6 UDP is fragment */
#define RX_CTRL_IPV6_UDP_CHECKSUM   	0x0008   /* Receive pass IPv6 UDP frame with UDP checksum is zero */
#define RX_CTRL_UDP_LITE_CHECKSUM   	0x0004   /* Enable UDP Lite frame checksum generation and verification */
#define RX_CTRL_ICMP_CHECKSUM       	0x0002   /* Enable ICMP frame checksum verification */
#define RX_CTRL_BLOCK_MAC           	0x0001   /* Receive drop frame if the SA is same as device MAC address */
#define RX_CTRL_BURST_LEN_MASK      	0x00e0  	/* SRDBL SPI Receive Data Burst Length */
#define RX_CTRL_BURST_LEN_4         	0x0000
#define RX_CTRL_BURST_LEN_8         	0x0020
#define RX_CTRL_BURST_LEN_16        	0x0040
#define RX_CTRL_BURST_LEN_32        	0x0060
#define RX_CTRL_BURST_LEN_FRAME     	0x0080
#define RXCR2_SRDBL_MASK			(0x7 << 5)
#define RXCR2_SRDBL_SHIFT			(5)
#define RXCR2_SRDBL_4B				(0x0 << 5)
#define RXCR2_SRDBL_8B				(0x1 << 5)
#define RXCR2_SRDBL_16B				(0x2 << 5)
#define RXCR2_SRDBL_32B				(0x3 << 5)
#define RXCR2_SRDBL_FRAME			(0x4 << 5)
#define RXCR2_IUFFP				    (1 << 4)
#define RXCR2_RXIUFCEZ				(1 << 3)
#define RXCR2_UDPLFE				(1 << 2)
#define RXCR2_RXICMPFCC				(1 << 1)
#define RXCR2_RXSAF				    (1 << 0)

#define TX_MEM_INFO_REG             	0x78 /**< TXQ Memory Information Register */
#define REG_TX_MEM_INFO            		0x78     /* TXMIR */
#define TX_MEM_AVAILABLE_MASK       	0x1FFF   /* The amount of memory available in TXQ */

#define RX_FRH_STAT_REG             	0x7C /**< Receive Frame Header Status Register */
#define REG_RX_FHR_STATUS          		0x7C     /* RXFHSR */
#define RX_VALID                    	0x8000   /* Frame in the receive packet memory is valid */
#define RX_ICMP_ERROR               	0x2000   /* ICMP checksum field doesn't match */
#define RX_IP_ERROR                 	0x1000   /* IP checksum field doesn't match */
#define RX_TCP_ERROR                	0x0800   /* TCP checksum field doesn't match */
#define RX_UDP_ERROR                	0x0400   /* UDP checksum field doesn't match */
#define RX_BROADCAST                	0x0080   /* Received frame is a broadcast frame */
#define RX_MULTICAST                	0x0040   /* Received frame is a multicast frame */
#define RX_UNICAST                  	0x0020   /* Received frame is a unicast frame */
#define RX_PHY_ERROR                	0x0010   /* Received frame has runt error */
#define RX_FRAME_ETHER              	0x0008   /* Received frame is an Ethernet-type frame */
#define RX_TOO_LONG                 	0x0004   /* Received frame length exceeds max size 0f 2048 bytes */
#define RX_RUNT_ERROR               	0x0002   /* Received frame was demaged by a collision */
#define RX_BAD_CRC                  	0x0001   /* Received frame has a CRC error */
#define RX_ERRORS                   	( RX_BAD_CRC | RX_TOO_LONG | RX_RUNT_ERROR | RX_PHY_ERROR | \
                                   		RX_ICMP_ERROR | RX_IP_ERROR | RX_TCP_ERROR | RX_UDP_ERROR )

