jsk-ros-pkg/jsk_aerial_robot/aerial_robot_nerve/stm32h7_nucleo/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
#define RX_FRH_BC_REG               	0x7E /**< Receive Frame Header Bytecount Register */
#define REG_RX_FHR_BYTE_CNT        		0x7E     /* RXFHBCR */
#define RX_BYTE_CNT_MASK            	0x0FFF   /* Received frame byte size mask */

#define TXQ_CMD_REG                 	0x80 /**< TXQ Command Register */
#define REG_TXQ_CMD                		0x80     /* TXQCR */
#define TXQ_AUTO_ENQUEUE            	0x0004   /* Enable enqueue tx frames from tx buffer automatically */
#define TXQ_MEM_AVAILABLE_INT       	0x0002   /* Enable generate interrupt when tx memory is available */
#define TXQ_ENQUEUE                 	0x0001   /* Enable enqueue tx frames one frame at a time */

#define RXQ_CMD_REG                 	0x82 /**< RXQ Command Register */
#define REG_RXQ_CMD                		0x82     /* RXQCR */
#define RXQ_STAT_TIME_INT           	0x1000   /* RX interrupt is occured by timer duration */
#define RXQ_STAT_BYTE_CNT_INT       	0x0800   /* RX interrupt is occured by byte count threshold */
#define RXQ_STAT_FRAME_CNT_INT      	0x0400   /* RX interrupt is occured by frame count threshold */
#define RXQ_TWOBYTE_OFFSET          	0x0200   /* Enable adding 2-byte before frame header for IP aligned with DWORD */
#define RXQ_TIME_INT                	0x0080   /* Enable RX interrupt by timer duration */
#define RXQ_BYTE_CNT_INT            	0x0040   /* Enable RX interrupt by byte count threshold */
#define RXQ_FRAME_CNT_INT           	0x0020   /* Enable RX interrupt by frame count threshold */
#define RXQ_AUTO_DEQUEUE            	0x0010   /* Enable release rx frames from rx buffer automatically */
#define RXQ_START                   	0x0008   /* Start QMU transfer operation */
#define RXQ_CMD_FREE_PACKET         	0x0001   /* Manual dequeue (release the current frame from RxQ) */

#define RXQ_CMD_CNTL                	(RXQ_FRAME_CNT_INT|RXQ_AUTO_DEQUEUE)

#define TX_FD_PTR_REG               	0x84 /**< TX Frame Data Pointer Register */
#define REG_TX_ADDR_PTR            		0x84     /* TXFDPR */
#define TXFDPR_TXFPAI				(1 << 14)
#define TXFDPR_TXFP_MASK			(0x7ff << 0)
#define TXFDPR_TXFP_SHIFT			(0)

#define RX_FD_PTR_REG               	0x86 /**< RX Frame Data Pointer Register */
#define REG_RX_ADDR_PTR            		0x86     /* RXFDPR */
#define RXFDPR_RXFPAI				(1 << 14)
#define ADDR_PTR_AUTO_INC           	0x4000   /* Enable Frame data pointer increments automatically */
#define ADDR_PTR_MASK               	0x03ff   /* Address pointer mask */

#define REG_RX_TIME_THRES          		0x8C     /* RXDTTR */
#define RX_TIME_THRESHOLD_MASK      	0xFFFF   /* Set receive timer duration threshold */

#define REG_RX_BYTE_CNT_THRES      		0x8E     /* RXDBCTR */
#define RX_BYTE_THRESHOLD_MASK      	0xFFFF 	/* Set receive byte count threshold */

#define INT_ENABLE_REG              	0x90 /**< Interrupt Enable Register */
#define REG_INT_MASK               		0x90     /* IER */
#define INT_PHY                    		0x8000   /* Enable link change interrupt */
#define INT_TX                      	0x4000   /* Enable transmit done interrupt */
#define INT_RX                      	0x2000   /* Enable receive interrupt */
#define INT_RX_OVERRUN              	0x0800   /* Enable receive overrun interrupt */
#define INT_TX_STOPPED              	0x0200   /* Enable transmit process stopped interrupt */
#define INT_RX_STOPPED              	0x0100   /* Enable receive process stopped interrupt */
#define INT_TX_SPACE                	0x0040   /* Enable transmit space available interrupt */
#define INT_RX_WOL_FRAME            	0x0020   /* Enable WOL on receive wake-up frame detect interrupt */
#define INT_RX_WOL_MAGIC            	0x0010   /* Enable WOL on receive magic packet detect interrupt */
#define INT_RX_WOL_LINKUP           	0x0008   /* Enable WOL on link up detect interrupt */
#define INT_RX_WOL_ENERGY           	0x0004   /* Enable WOL on energy detect interrupt */
#define INT_RX_SPI_ERROR            	0x0002   /* Enable receive SPI bus error interrupt */
#define INT_RX_WOL_DELAY_ENERGY     	0x0001   /* Enable WOL on delay energy detect interrupt */
#define INT_MASK                    	( INT_RX | INT_TX | INT_PHY )
#define INT_NO_INT                     	0x0000

/* Interrupt Enable Register Options */
#define   INT_LINK_CHANGE     			0x8000	/** Enable link change interrupt */
#define   INT_TX_DONE         			0x4000	/** Enable transmit done interrupt */
#define   INT_RX_DONE         			0x2000	/** Enable receive interrupt */
#define   INT_RX_OVERRUN      			0x0800	/** Enable receive overrun interrupt */
#define   INT_TX_STOPPED      			0x0200	/** Enable transmit process stopped interrupt */
#define   INT_RX_STOPPED      			0x0100	/** Enable receive process stopped interrupt */
#define   INT_TX_SPACE        			0x0040	/** Enable transmit space available interrupt */
#define   INT_RX_WOL_FRAME    			0x0020	/** Enable WOL on receive wake-up frame detect interrupt */
#define   INT_MAGIC           			0x0010	/** Enable magic packet detect interrupt */
#define   INT_LINKUP          			0x0008	/** Enable link up detect interrupt */
#define   INT_ENERGY          			0x0004	/** Enable detect interrupt */
#define   INT_SPI_ERROR       			0x0002	/** Enable receive SPI bus error interrupt */

/** Interrupt mask initialization collection */
#define INT_MASK_EXAMPLE    	(KSZ8851SNL_INT_RX_DONE |    \
                                 KSZ8851SNL_INT_RX_OVERRUN | \
                                 KSZ8851SNL_INT_TX_STOPPED | \
                                 KSZ8851SNL_INT_RX_STOPPED | \
                                 KSZ8851SNL_INT_TX_DONE |    \
                                 KSZ8851SNL_INT_LINK_CHANGE)

/* Interrupt Enable Register Options */
#define KSZ8851SNL_INT_LINK_CHANGE     		0x8000
#define KSZ8851SNL_INT_TX_DONE         		0x4000
#define KSZ8851SNL_INT_RX_DONE         		0x2000
#define KSZ8851SNL_INT_RX_OVERRUN      		0x0800
#define KSZ8851SNL_INT_TX_STOPPED      		0x0200
#define KSZ8851SNL_INT_RX_STOPPED      		0x0100
#define KSZ8851SNL_INT_TX_SPACE        		0x0040
#define KSZ8851SNL_INT_RX_WOL_FRAME    		0x0020
#define KSZ8851SNL_INT_RX_WOL_MAGIC    		0x0010
#define KSZ8851SNL_INT_RX_WOL_LINKUP        0x0008
#define KSZ8851SNL_INT_RX_WOL_ENERGY        0x0004
#define KSZ8851SNL_INT_RX_SPI_ERROR       	0x0002
#define KSZ8851SNL_INT_RX_WOL_DELAY_ENERGY	0x0001
#define KSZ8851SNL_INT_ENABLE_MASK			(KSZ8851SNL_INT_RX_DONE | \
											 KSZ8851SNL_INT_RX_STOPPED | \
											 KSZ8851SNL_INT_TX_STOPPED | \
											 KSZ8851SNL_INT_LINK_CHANGE | \
											 KSZ8851SNL_INT_RX_SPI_ERROR)

