jsk-ros-pkg/jsk_aerial_robot/aerial_robot_nerve/stm32h7_nucleo/Drivers/KSZ8851SNL/Inc/KSZ8851SNL_reg.h
#define INT_STATUS_REG              	0x92 /**< Interrupt Status Register */
#define REG_INT_STATUS             		0x92    	/* ISR */

#define IRQ_LCI					(1 << 15)
#define IRQ_TXI					(1 << 14)
#define IRQ_RXI					(1 << 13)
#define IRQ_RXOI				(1 << 11)
#define IRQ_TXPSI				(1 << 9)
#define IRQ_RXPSI				(1 << 8)
#define IRQ_TXSAI				(1 << 6)
#define IRQ_RXWFDI				(1 << 5)
#define IRQ_RXMPDI				(1 << 4)
#define IRQ_LDI					(1 << 3)
#define IRQ_EDI					(1 << 2)
#define IRQ_SPIBEI				(1 << 1)
#define IRQ_DEDI				(1 << 0)

#define RX_FRAME_THRES_REG          	0x9C /**< RX Frame Count & Threshold Register */
#define REG_RX_FRAME_CNT_THRES     		0x9C     /* RXFCTFC */
#define RX_FRAME_CNT_MASK           	0xFF00   /* Received frame count mask */
#define RX_FRAME_THRESHOLD_MASK     	0x00FF   /* Set receive frame count threshold mask */

#define KS_RXFCTR				    0x9D
#define RXFCTR_RXFC_MASK			(0xff << 8)
#define RXFCTR_RXFC_SHIFT			(8)
#define RXFCTR_RXFC_GET(_v)			(((_v) >> 8) & 0xff)
#define RXFCTR_RXFCT_MASK			(0xff << 0)
#define RXFCTR_RXFCT_SHIFT			(0)

#define TX_NEXT_FRS_REG             0x9E /**< TX Next Frame size register */
#define REG_TX_TOTAL_FRAME_SIZE    	0x9E     /* TXNTFSR */
#define TX_TOTAL_FRAME_SIZE_MASK    0xFFFF   /* Set next total tx frame size mask */

/*
 * MAC Address Hash Table Control Registers
 * (Offset 0xA0 - 0xA7)
 */
#define REG_MAC_HASH_0             		0xA0  	/* MAHTR0 */
#define REG_MAC_HASH_1             		0xA1
#define REG_MAC_HASH_2             		0xA2    	/* MAHTR1 */
#define REG_MAC_HASH_3             		0xA3
#define REG_MAC_HASH_4             		0xA4   	/* MAHTR2 */
#define REG_MAC_HASH_5             		0xA5
#define REG_MAC_HASH_6             		0xA6    	/* MAHTR3 */
#define REG_MAC_HASH_7             		0xA7

/*
 * QMU Receive Queue Watermark Control Registers
 * (Offset 0xB0 - 0xB5)
 */
#define FLOW_CTRL_LOW_WATERMARK     	0xB0 /**< Configure Low Watermark to 6KByte */
#define REG_RX_LOW_WATERMARK       		0xB0   	/* FCLWR */
#define RX_LOW_WATERMARK_MASK       	0x0FFF   /* Set QMU RxQ low watermark mask */

#define FLOW_CTRL_HIGH_WATERMARK    	0xB2 /**< Configure High Watermark to 4KByte */
#define REG_RX_HIGH_WATERMARK      		0xB2     /* FCHWR */
#define RX_HIGH_WATERMARK_MASK      	0x0FFF   /* Set QMU RxQ high watermark mask */

#define REG_RX_OVERRUN_WATERMARK   		0xB4     /* FCOWR */
#define RX_OVERRUN_WATERMARK_MASK  		0x0FFF  	/* Set QMU RxQ overrun watermark mask */

/*
 * Global Control Registers
 * (Offset 0xC0 - 0xD3)
 */
#define CIDER_REG                   	0xC0 /**< Chip ID and Enable Register */
#define REG_CHIP_ID                		0xC0    	/* CIDER */
#define CHIP_ID_MASK                	0xFFF0   /* Family ID and chip ID mask */
#define REVISION_MASK               	0x000E   /* Chip revision mask */
#define CHIP_ID_SHIFT               	4
#define REVISION_SHIFT              	1
#define CHIP_ID_8851_16             	0x8870   /* KS8851-16/32MQL chip ID */

#define REG_LED_CTRL               		0xC6     /* CGCR */
#define LED_CTRL_SEL1            		0x8000   /* Select LED3/LED2/LED1/LED0 indication */
#define LED_CTRL_SEL0               	0x0200   /* Select LED3/LED2/LED1/LED0 indication */

#define IND_ACC_CTRL_REG            	0xC8 /**< Indirect access control Register */
#define REG_IND_IACR               		0xC8   	/* IACR */
#define TABLE_READ                  	0x1000  	/* Indirect read */
#define TABLE_MIB                   	0x0C00  	/* Select MIB counter table */
#define TABLE_ENTRY_MASK            	0x001F  	/* Set table entry to access */

#define IND_ACC_DATA_LOW_REG        	0xD0 /**< Indirect access data low Register */
#define REG_IND_DATA_LOW           		0xD0  	/* IADLR */

#define IND_ACC_DATA_HIGH_REG       	0xD2 /**< Indirect access data low Register */
#define REG_IND_DATA_HIGH          		0xD2   	/* IADHR */

/*
 * Power Management Control Registers
 * (Offset 0xD4 - 0xD7)
 */
#define REG_POWER_CNTL             		0xD4    	/* PMECR */
#define PME_DELAY_ENABLE            	0x4000   /* Enable the PME output pin assertion delay */
#define PME_ACTIVE_HIGHT            	0x1000   /* PME output pin is active high */
#define PME_FROM_WKFRAME            	0x0800   /* PME asserted when wake-up frame is detected */
#define PME_FROM_MAGIC              	0x0400   /* PME asserted when magic packet is detected */
#define PME_FROM_LINKUP             	0x0200 	/* PME asserted when link up is detected */
#define PME_FROM_ENERGY             	0x0100   /* PME asserted when energy is detected */
#define PME_EVENT_MASK              	0x0F00   /* PME asserted event mask */
#define WAKEUP_AUTO_ENABLE          	0x0080   /* Enable auto wake-up in energy mode */
#define WAKEUP_NORMAL_AUTO_ENABLE   	0x0040   /* Enable auto goto normal mode from energy detecion mode */
#define WAKEUP_FROM_WKFRAME         	0x0020   /* Wake-up from wake-up frame event detected */
#define WAKEUP_FROM_MAGIC           	0x0010   /* Wake-up from magic packet event detected */
#define WAKEUP_FROM_LINKUP          	0x0008   /* Wake-up from link up event detected */
#define WAKEUP_FROM_ENERGY          	0x0004   /* Wake-up from energy event detected */
#define WAKEUP_EVENT_MASK           	0x003C   /* Wake-up event mask */
#define POWER_STATE_D1              	0x0003   /* Power saving mode */
#define POWER_STATE_D3              	0x0002   /* Power down mode */
#define POWER_STATE_D2              	0x0001   /* Power detection mode */
#define POWER_STATE_D0              	0x0000   /* Normal operation mode (default) */
#define POWER_STATE_MASK            	0x0003   /* Power management mode mask */

#define REG_WAKEUP_TIME          		0xD6   	/* GSWUTR */
#define WAKEUP_TIME                 	0xFF00   /* Min time (sec) wake-uo after detected energy */
#define GOSLEEP_TIME                	0x00FF   /* Min time (sec) before goto sleep when in energy mode */

/*
 * PHY Control Registers
 * (Offset 0xD8 - 0xF9)
 */
#define PHY_RST_REG                 	0xD8 /**< PHY Reset Register  */
#define REG_PHY_RESET              		0xD8     /* PHYRR */
#define PHY_RESET_REG_VALUE      		0x0001 	/* Reset PHY */

